import Vue from 'vue'
import Vuex from 'vuex'

Vue.use(Vuex)

export default new Vuex.Store({
  state: {
    courses: [
      {
        id: 1,
        name: 'Социальные сети',
        description: 'Начальных знаний не требуется. Информационная безопасность в социальных сетях',
        backgroundImage: require('../assets/img/social-networks.png'),
        syllabus: []
      },
      {
        id: 2,
        name: 'Смартфоны',
        description: 'Начальных знаний не требуется. Как эффективно использовать смартфон в повседневной деятельности.',
        fullDescription: '<p>Доскональное углубленное знание операционной системы, которая установлена на большинстве мобильных устройств таких корпораций как Samsung, Sony и HTC, это всегда преимущество. Вы сможете свободно ориентироваться во всех возможностях Android, используя по максимуму функционал своего смартфона или планшета. И это не просто развлечение или возможность похвастаться перед друзьями своими умениями.</p>' +
          '<br/><p class="font-bold">Польза обучения Android:</p>' +
          '<ul class="mt-2 pl-4">' +
          '<li>Во-первых, самый первый бонус – возможность самостоятельно и совершенно бесплатно находить и устанавливать все необходимые приложения на своё мобильное устройство. За индивидуальную настройку берут совсем немаленькие деньги в точках продаж и обслуживания электроники. Зачем кому-то платить, если можно сделать это самостоятельно?</li>'+
          '<li>Во-вторых, малоизвестных, но весьма полезных функций в Android, предостаточно. Хотите использовать свой гаджет на 100%? Пройдите курсы и пользуйтесь в своё удовольствие.</li>'+
          '<li>В-третьих, безопасность, которая обеспечена при грамотной работе с Android.</li>'+
          '<li>Ну и такие мелкие приятные нюансы, как помощь друзьям и родственникам в настройке их мобильных устройств, установке антивирусных программ, например, или применение навигатора.</li>'+
          '</ul>' +
          '<br/>' +
          '<p>Многие полезные и необходимые в повседневной жизни функции Android станут доступны именно благодаря нашим пользовательским курсам. Грамотная работа с мобильным телефоном и планшетом на базе данной операционной системы позволяет уникально настроить свой гаджет с нуля, наиболее удобным для Вас образом. Все приложения, которые нужны и полезны именно Вам, будут под рукой, память устройства в порядке, антивирус успешно будет защищать, а мастер очистки – удалять лишнее. Всё, что Вам будет полезно и удобно, поместится в небольшом смартфоне.</p>',
        backgroundImage: require('../assets/img/smartphones.png'),
        syllabus: []
      },
      {
        id: 3,
        name: 'Web-разработка',
        description: 'Начальных знаний не требуется. Вперед, научим вас делать классные web-страницы!',
        fullDescription: '<p>На этом курсе вы узнаете как работает интернет, научитесь создавать сайты с помощью HTML и CSS и размещать их в сети. Попутно освоите основные инструменты веб-разработчика: редактор кода, отладчик, Google.</p><br/>\n' +
          '\n' +
          '<p>Не бойтесь страшных непонятных слов! Курс создан специально для людей, которые никогда не программировали и ничего не знают о работе интернета.</p> <br/><p>Вы научитесь верстать сайты на HTML и CSS, изучите JavaScript, сможете разрабатывать на PHP серверную часть сайта — и сделаете первые проекты для портфолио.</p>',
        backgroundImage: require('../assets/img/webdev.png'),
        syllabus: [
          {
            lessonSection: {
              name: 'Веб-вёрстка',
              lessons: [
                {
                  lessonName: 'Вводный модуль',
                },
                {
                  lessonName: 'HTML',
                },
                {
                  lessonName: 'Основы CSS',
                },
                {
                  lessonName: 'Инструменты разработчика',
                },
                {
                  lessonName: 'Адаптивность и кроассбраузерность',
                },
                {
                  lessonName: 'Основы JavaScript',
                },
                {
                  lessonName: 'Оформление',
                },
                {
                  lessonName: 'Advanced CSS',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'JavaScript',
              lessons: [
                {
                  lessonName: 'Знакомство с языком',
                },
                {
                  lessonName: 'Основы',
                },
                {
                  lessonName: 'Функции',
                },
                {
                  lessonName: 'Массивы и объекты',
                },
                {
                  lessonName: 'Замыкания',
                },
                {
                  lessonName: 'Объекты и конструкторы',
                },
                {
                  lessonName: 'Объектно-ориентированное программирование',
                },
                {
                  lessonName: 'JavaScript в браузере, DOM',
                },
                {
                  lessonName: 'Web API',
                },
                {
                  lessonName: 'Клиент и сервер',
                },
                {
                  lessonName: 'jQuery',
                },
                {
                  lessonName: 'Современный JavaScript, ES2015',
                },
                {
                  lessonName: 'Введение в концепцию реактивных фреймворков, Vue.js',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'PHP',
              lessons: [
                {
                  lessonName: 'Введение в программирование',
                },
                {
                  lessonName: 'Структура управления данными. Базовые концепции PHP 7',
                },
                {
                  lessonName: 'Протокол HTTP/HTTPS',
                },
                {
                  lessonName: 'Пользовательские функции',
                },
                {
                  lessonName: 'Файлы и каталоги',
                },
                {
                  lessonName: 'Cookie/Session',
                },
                {
                  lessonName: 'База данных MySQL',
                },
              ]
            },
          },
        ]
      },
      {
        id: 4,
        name: 'T-SQL',
        description: 'Начальных знаний не требуется. Достаточно иметь желание научиться работать с базами данных SQL.',
        fullDescription: '<p>В этом курсе изложены основы языка SQL для реляционных баз данных.</p>' +
                         '<p>Язык SQL кажется простым - и это действительно так. Однако в каждом деле есть свои тонкости. ' +
                         'И эти тонкости изложены в этом курсе - это работа со значениями NULL, дубликаты строк и потеря строк при соединении таблиц и многие другие.</p>' +
                          '<br/><p>Зачем нужен SQL ?  Этот навык нужен во многих профессиях - программистам, тестировщикам, администраторам баз данных, аналитикам, data scientist\'ам и многим другим.  Объём данных в мире растёт экспоненциальными темпами. И многие из этих данных по-прежнему реляционные - состоят из таблиц, строк и колонок. Поэтому язык SQL не только не теряет своей актуальности, но со временем становится всё более и более востребованным!</p>',
        backgroundImage: require('../assets/img/t-sql.png'),
        syllabus: [
          {
            lessonSection: {
              name: 'Введение. Обзор языка SQL',
              lessons: [
                {
                  lessonName: 'Обзор языка SQL',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Установка и настройка таблиц для упражнений',
              lessons: [
                {
                  lessonName: 'Шаги установки',
                },
                {
                  lessonName: 'Установа для Windows',
                },
                {
                  lessonName: 'Обзор pgAdmin',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Создание таблиц. Связи между таблицами',
              lessons: [
                {
                  lessonName: 'Создание таблиц. Типы данных',
                },
                {
                  lessonName: 'Первичный ключ и внешний ключ. Типы связей между таблицами',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Основные запросы SELECT',
              lessons: [
                {
                  lessonName: 'Выбор колонок. Выражения',
                },
                {
                  lessonName: 'Выбор строк. Операторы AND, OR',
                },
                {
                  lessonName: 'Оператора IN, NOT IN, BETWEEN',
                },
                {
                  lessonName: 'Вложенные запросы (подзапросы)',
                },
                {
                  lessonName: 'Как пишутся комментарии в SQL',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Работа со значениями NULL',
              lessons: [
                {
                  lessonName: 'Что такое значение NULL. Особенности работы со значениями NULL',
                },
                {
                  lessonName: 'NULL и Сравнение "не равно"',
                },
                {
                  lessonName: 'IN и NOT IN при наличии значений NULL',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Агрегация - GROUP BY, HAVING, DISTINCT',
              lessons: [
                {
                  lessonName: 'Группировка данных GROUP BY',
                },
                {
                  lessonName: 'Фильтрация HAVING',
                },
                {
                  lessonName: 'Агрегация SUM и COUNT',
                },
                {
                  lessonName: 'Другие функции агрегации',
                },
                {
                  lessonName: 'Различные значения DISTINCT',
                },
                {
                  lessonName: 'Сортировка данных ORDER BY',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Соединение таблиц - INNER, OUTER, CROSS, SELF JOIN',
              lessons: [
                {
                  lessonName: 'INNER JOIN - Внутреннее Соединение Таблиц',
                },
                {
                  lessonName: 'Соединение Нескольких Таблиц',
                },
                {
                  lessonName: 'Дубликаты Строк, Нехватка Строк',
                },
                {
                  lessonName: 'LEFT OUTER JOIN - Левое Внешнее Соединение',
                },
                {
                  lessonName: 'Различные варианты синтаксиса',
                },
                {
                  lessonName: 'RIGHT OUTER JOIN- Правое Внешнее Соединение',
                },
                {
                  lessonName: 'FULL OUTER JOIN - Полное внешнее соединение',
                },
                {
                  lessonName: 'SELF JOIN - Соединение таблицы самой с собой',
                },
                {
                  lessonName: 'CROSS JOIN - Декартово Произведение Таблиц',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Операторы множеств - UNION, EXCEPT (MINUS) и INTERSECT',
              lessons: [
                {
                  lessonName: 'UNION - Объединение множеств строк',
                },
                {
                  lessonName: 'EXCEPT (MINUS) - Вычитание множеств строк',
                },
                {
                  lessonName: 'INTERSECT - Пересечение множеств строк',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Функции и операторы',
              lessons: [
                {
                  lessonName: 'Обзор функций и операторов',
                },
                {
                  lessonName: 'Для числовых типов данных',
                },
                {
                  lessonName: 'LIKE для поиска шаблонов',
                },
                {
                  lessonName: 'Для символьных типов данных',
                },
                {
                  lessonName: 'Для типов данных даты и времени',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Изменение данных - INSERT, UPDATE, DELETE',
              lessons: [
                {
                  lessonName: 'INSERT - Вставка данных',
                },
                {
                  lessonName: 'UPDATE - Обновление данных',
                },
                {
                  lessonName: 'DELETE - Удаление данных',
                },
                {
                  lessonName: 'Поиск расхождений между таблицами',
                },
                {
                  lessonName: 'Устранение расхождений между таблицами',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Дополнительные темы: CASE, рекурсия',
              lessons: [
                {
                  lessonName: 'CASE: два варианта синтаксиса',
                },
                {
                  lessonName: 'CASE: полезные примеры',
                },
                {
                  lessonName: 'Как можно переписать IN / NOT IN на OUTER JOIN + CASE',
                },
                {
                  lessonName: 'Рекурсивные Запросы',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Резюме курса',
              lessons: [
                {
                  lessonName: 'Резюме курса',
                },
              ]
            },
          },
        ]
      },
      {
        id: 5,
        name: 'Английский язык',
        description: 'Начальных знаний не требуется. Грамматика и актуальное применение современного английского языка',
        fullDescription: '<p>Способность легко осваивать разговорный язык заложена в нас генетически. Каждый школьник еще до изучения грамматики уже свободно общается на родном языке с родителями и друзьями.</p><br/>' +
          '<p> У нас в стране обучение иностранному языку было поставлено с ног на голову: вас загружали грамматическими правилами, зубрежкой слов, скучными текстами — вопреки естественным, данным природой, механизмам обучения.</p><br/>' +
          '<p>В авторской методике воспроизводится естественный процесс освоения языка: через общение, реальные жизненные ситуации, погружение в языковую среду. </p>',
        backgroundImage: require('../assets/img/english-course.png'),
        syllabus: []
      },
      {
        id: 6,
        name: 'Профессиональная Web-разработка',
        description: 'Курс продвинутой разработки PHP,  ООП и Symfony. Требования: Для прохождения курса необходимо уверенно владеть базовым синтаксисом PHP и иметь представление о работе с SQL.',
        fullDescription: '<p>Чем отличается Senior от Middle? Или Middle от Junior? Есть ли задачи, которые может сделать только опытный разработчик? Практика показывает, что любую задачу может выполнить программист любого уровня. Зачем же тогда глубоко изучать инструмент? Ответ очень прост: качество и скорость.</p><br/>' +
          '<p>В данном курсе вы познакомитесь с общепринятыми правилами и рекомендациями, которые применяются во всех областях и для всех языков программирования. Углубитесь в ООП возможности языка программирования PHP, изучите современные инструменты разработки веб-сайтов, а так же, один из самых популярных фреймворков - Symfony 5.</p><br/>' +
          '<p>По завершению курса, вы будете создавать качественные, масштабируемые веб-проекты, в несколько десятков раз быстрее, чем могли это делать ранее.</p>',
        backgroundImage: require('../assets/img/php7.png'),
        syllabus: [
          {
            lessonSection: {
              name: 'Основы',
              lessons: [
                {
                  lessonName: 'Типизация в PHP7+',
                },
                {
                  lessonName: 'Анонимные функции и замыкания',
                },
                {
                  lessonName: 'Классы',
                },
                {
                  lessonName: 'Интерфейсы',
                },
                {
                  lessonName: 'Абстрактные классы',
                },
                {
                  lessonName: 'Наследование',
                },
                {
                  lessonName: 'Композиция',
                },
                {
                  lessonName: 'Агрегация',
                },
                {
                  lessonName: 'Трейты',
                },
                {
                  lessonName: 'Пространства имен',
                },
                {
                  lessonName: 'PSR',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'UML',
              lessons: [
                {
                  lessonName: 'Что такое UML?',
                },
                {
                  lessonName: 'Диаграмма прецедентов',
                },
                {
                  lessonName: 'Диаграмма активности',
                },
                {
                  lessonName: 'Диаграмма классов',
                },
                {
                  lessonName: 'Диаграмма последовательностей',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Архитектура',
              lessons: [
                {
                  lessonName: 'Принципы SOLID',
                },
                {
                  lessonName: 'Введение в паттерны',
                },
                {
                  lessonName: 'Порождающие паттерны (5)',
                },
                {
                  lessonName: 'Структурные паттерны (7)',
                },
                {
                  lessonName: 'Поведенческие паттерны (10)',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Composer',
              lessons: [
                {
                  lessonName: 'Установка библиотек',
                },
                {
                  lessonName: 'Управление версиями',
                },
                {
                  lessonName: 'Сервис packagist.org',
                },
                {
                  lessonName: 'Обновление зависимостей',
                },
                {
                  lessonName: 'Автоматическое подключение классов',
                },
                {
                  lessonName: 'Создание своей библиотеки',
                },
                {
                  lessonName: 'Публикация своей библиотеки',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'PHPUnit',
              lessons: [
                {
                  lessonName: 'Введение в тестирование',
                },
                {
                  lessonName: 'Создание и настройка TestSuite',
                },
                {
                  lessonName: 'Юнит-тестирование',
                },
                {
                  lessonName: 'Макеты',
                },
                {
                  lessonName: 'Работа с исключениями',
                },
                {
                  lessonName: 'Аннотации PHPUnit',
                },
                {
                  lessonName: 'Оценка покрытия',
                },
                {
                  lessonName: 'TDD',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Symfony. Основы',
              lessons: [
                {
                  lessonName: 'Что такое Symfony?',
                },
                {
                  lessonName: 'Создание проекта',
                },
                {
                  lessonName: 'Обзор структуры',
                },
                {
                  lessonName: 'Конфигурация окружения',
                },
                {
                  lessonName: 'Управление сервером',
                },
                {
                  lessonName: 'Контроллеры',
                },
                {
                  lessonName: 'Роутинг',
                },
                {
                  lessonName: 'Twig. Базовый синтаксис',
                },
                {
                  lessonName: 'Сущности и репозитории',
                },
                {
                  lessonName: 'Отношения сущностей',
                },
                {
                  lessonName: 'Doctrine. Основы',
                },
                {
                  lessonName: 'Сервисы',
                },
                {
                  lessonName: 'Dependency Injection',
                },
                {
                  lessonName: 'События',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Symfony. Формы',
              lessons: [
                {
                  lessonName: 'Работа с формами',
                },
                {
                  lessonName: 'Типы данных',
                },
                {
                  lessonName: 'Валидация',
                },
                {
                  lessonName: 'Формы и Twig',
                },
                {
                  lessonName: 'Оформление форм',
                },
                {
                  lessonName: 'Обработка форм',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Symfony. Панель администратора',
              lessons: [
                {
                  lessonName: 'Установка EasyAdmin',
                },
                {
                  lessonName: 'Добавление сущностей',
                },
                {
                  lessonName: 'Настройка списков',
                },
                {
                  lessonName: 'Настройка форм',
                },
                {
                  lessonName: 'Типы данных',
                },
                {
                  lessonName: 'Настройка внешнего вида',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Symfony. Безопасность',
              lessons: [
                {
                  lessonName: 'UserInterface',
                },
                {
                  lessonName: 'Шифрование паролей',
                },
                {
                  lessonName: 'Генерация формы авторизации',
                },
                {
                  lessonName: 'Собственный обработчик авторизации',
                },
                {
                  lessonName: 'Управление доступами',
                },
                {
                  lessonName: 'OAuth2',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Symfony. Консоль',
              lessons: [
                {
                  lessonName: 'Обзор возможностей консоли',
                },
                {
                  lessonName: 'Базовые команды',
                },
                {
                  lessonName: 'Создание своих команд',
                },
                {
                  lessonName: 'Конфигурирование',
                },
                {
                  lessonName: 'Уровни вывода',
                },
              ]
            },
          },
          {
            lessonSection: {
              name: 'Symfony. REST',
              lessons: [
                {
                  lessonName: 'Введение в API-Platform',
                },
                {
                  lessonName: 'Swagger',
                },
                {
                  lessonName: 'json-ld',
                },
                {
                  lessonName: 'Управление методами',
                },
                {
                  lessonName: 'Представления данных',
                },
                {
                  lessonName: 'Дочерние ресурсы',
                },
                {
                  lessonName: 'Пред-обработка ресурсов',
                },
                {
                  lessonName: 'Валидация',
                },
                {
                  lessonName: 'Доступы',
                },
              ]
            },
          },
        ]
      },

    ]
  },
  getters: {
    getCourses: state => {
      return state.courses;
    },
    getCourseData: (state) => (id)  => {
      return state.courses.find(course => course.id === id);
    }
  }
  ,
  mutations: {
  },
  actions: {
  },
  modules: {
  }
})
