<template>
    <div class="container">
        <div class="w-full p-4">
            <p>Мы учим людей с нуля осваивать программирование, работу в соцсетях и эффективное использование смартфонов.</p>
            <p>Проводим онлайн-курсы со стажировкой, развиваем сообщество, непрерывно тестируем новые методики для поднятия эффективности обучения.</p><br/>
            <p>Наблюдая оторванность современной системы образования от реальных потребностей рынка труда, мы просто не могли не создать этот портал. С каждым новым участником наш коллективный разум делает проект еще полезнее.</p><br/>
            <p>Мы создаем современную систему образования. Верим, что когда-нибудь получение полноценной профессии через интернет станет новой реальностью для человечества. Ведь это открывает безграничные возможности для амбициозных и энергичных людей!</p><br/>
            <p>Хотите стать частью команды и передать свои знания другим? <router-link to="/teaching" class="text-accentColor underline">Присоединяйтесь!</router-link></p>
        </div>
    </div>
</template>


<script>
  export default {
    name: "About"
  }
</script>

<style scoped>

</style>
